// Напишите код, который посчитает сумму всех парных элементов в массиве. В суммировании участвуют только элементы больше 3.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const array = [1, 2, 3, 4, 5, 6];

////////////////// Решение //////////////////
const array = [1, 2, 3, 4, 5, 6];
var itogo_need  = 0;
//var chislo;

for (chislo of array) {
    if (chislo > 3 && chislo % 2 === 0) {
        itogo_need  = itogo_need + chislo;
    }
}
console.log(itogo_need);