// Отсортируйте массив по убыванию.
// Использовать встроенные методы массивов — нельзя.

////////////////// Задание //////////////////
// const arr = [1, 2, 3, 4, 5, 6];
// [6,5,4,3,2,1]

////////////////// Решение //////////////////
const arr = [1, 2, 3, 4, 5, 6];
var element;

for (var i = 0; i < 5; ++i) {
    for (var j = 0; j < 5; ++j) {
        if (arr[j] < arr[j + 1] ) {
            let pred = arr[j];
            arr[j] = arr[j + 1];
            arr[j + 1] = pred;
        }
    }
}
for (element of arr) {
    console.log(element);
}